Autodesk.Revit.DB.PlanCircuit.GetPointInside
Returns a point inside the circuit.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when a valid UV point couldn't be obtained.
Since: 2015

Autodesk.Revit.DB.PlanCircuit.IsRoomLocated
Reports whether there is a room located in this circuit.
True if there is a room located in this circuit on the circuit's level, false if there is no room
located in this circuit on the circuit's level.

Autodesk.Revit.DB.PlanCircuit.Area
The enclosed area of the circuit.

Autodesk.Revit.DB.PlanCircuit.SideNum
The number of sides in the circuit.

Autodesk.Revit.DB.PlanCircuit
An object that represents an enclosed area in a plan view within the Autodesk Revit project.
Remarks: Plan circuits are enclosed regions as seen on a plan view.  They are used to determine the
boundary extents of rooms based on the placement of walls.  In the Autodesk Revit API, you can use
plan circuits to create new rooms.